CSI API ETABS v1
cLineElm.GetLocalAxes Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLocalAxes(
	string Name,
	ref double Ang
)
Function GetLocalAxes (
	Name As String,
	ByRef Ang As Double
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Ang As Double
Dim returnValue As Integer
returnValue = instance.GetLocalAxes(Name,
	Ang)
int GetLocalAxes(
	String^ Name,
	double% Ang
)
abstract GetLocalAxes :
        Name : string *
        Ang : float byref -> int
Parameters
Name
Type: System.String
Ang
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace